export function getRecommendation(score: number): string {
    if (score <= 2) {
        return "Денес изгледа дека ти беше потежок ден. Обиди се да забавиш малку, да одмориш и да направиш нешто што ти годи.";
    }

    if (score <= 3) {
        return "Твојот ден е во средина. Можеби ќе ти помогне кратка пауза или нешто мало што те опушта.";
    }

    if (score <= 4) {
        return "Имаш стабилен и добар ден 🙂 Продолжи со навиките што ти носат рамнотежа.";
    }

    return "Денес си во добра состојба 😄 Продолжи со ритамот што ти одговара и одржувај ја оваа енергија.";
}