export function getRecommendation(score: number): string {
    if (score <= 2) {
        return "Денес изгледа дека сте имале потежок ден. Обидете се да забавите, да одморите, изгледајте филм, играјте игра, прошетајте.";
    }

    if (score <= 3) {
        return "Ниту предобро, ниту прелошо, сте имале монотон ден. Можеби ќе ви помогне кратка пауза и да се опуштите со некое ваше хоби.";
    }

    if (score <= 4) {
        return "Имавте стабилен и добар ден, продолжете со навиките што ви ја носат рамнотежата.";
    }

    return "Денес сте во добра состојба, продолжете со ритамот што ви одговара и одржувај ја високата енергија!";
}